app/controllers/pictures_controller.rb

  def create
    Picture.transaction do
      uploaded_io = picture_params[:file]
      ext = File.extname uploaded_io.original_filename
      generated_name = SecureRandom.urlsafe_base64(GENERATED_NAME_SIZE) + ext
      path =Rails.root.join(UPLOADS_PATH, generated_name)
      File.open(path, 'wb') do |file|
        file.write(uploaded_io.read)
      end
      @picture = Picture.new
      @picture.generated_name = generated_name
      @picture.a = uploaded_io
      @picture.user = current_user

      if @picture.save
---
INSERT INTO `pictures` (`generated_name`, `a_file_name`, `a_content_type`, `a_file_size`, `a_updated_at`, `user_id`, `created_at`, `updated_at`) VALUES ('wCBXV78rjdXyNvm3t9VjZldI1Ko83k6synAk9WfGp6PunRJMJAnMAK8dYlXv-b6NPxZOndtlOCXFET6qAIzy4KMaqC-hdkwKzcyMie0bn3X9enb4nl9Rfy3t67F3kbFJG7EJ-Q.jpg', 'images.jpg', 'image/jpeg', 8600, '2017-02-04 14:38:08', 2, '2017-02-04 14:38:09', '2017-02-04 14:38:09')