app/controllers/projects_controller.rb

  def index
    # TODO: Get tags from search (default to none)
    # TODO: Location should use users address, web location, or address fields. If all 3 blank, do not return anything
    tags =[Tag.first]
---
SELECT  `tags`.* FROM `tags`  ORDER BY `tags`.`id` ASC LIMIT 1

  def search
    params = search_params
    latlng = [params[:lat], params[:lng]]
    tags = params[:tags].split(",").each { |id| Tag.find_by_id(id) }
---
SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1

  def new
    @project = ProjectDTO.new
    @tags = SimpleDTO.instances_to_array_of_hashes(Tag.all)
---
SELECT `tags`.* FROM `tags`