app/controllers/users/registrations_controller.rb

  def edit
    @user = current_user
    business = @user.business
    # @preference = current_user.preference
    @locations = current_user.locations
    @address = AddressDTO.instance_to_hash(@user.address)
    # @address = AddressDTO.instance_to_hash(current_user.address)
    @pictures = ImageDTO.instances_to_array_of_hashes(current_user.pictures)
    # @pictures = ImageDTO.instances_to_array_of_hashes(current_user.pictures)
    @business =  business ? BusinessDTO.instance_to_hash(business) : nil
    @preferences = PreferencesDTO.instances_to_array_of_hashes(@user.user_preferences)
    @tags = business ? SimpleDTO.instances_to_array_of_hashes(Tag.all.where.not(id: business.tags)) :
---
SELECT  `businesses`.* FROM `businesses` WHERE `businesses`.`user_id` = 2 LIMIT 1
SELECT `tags`.* FROM `tags`